fan/constant/fanCurve
5 // five points in the table
(
(5 10) //(velocity pressure_jump)
(10 40)
(20 60)
(30 40)
(40 5)
)