fan/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            heRhoThermo;
    mixture         pureMixture;
    transport       const;
    thermo          hConst;
    // equationOfState perfectGas;
    equationOfState incompressiblePerfectGas;
    // equationOfState rhoConst; 
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles          1;
        molWeight       28.96;
    }
    thermodynamics
    {
        // Cp              1004.4;
        Cp              1001.1; 
        Hf              0;
    }
    transport
    {
        // mu              1.831e-05;
        mu              2.286e-5; 
        // Pr              0.705;
        Pr              .688; 
    }
    equationOfState
    {
        pRef 1e5; 
        // rho 1.18586764829; 
    }
}


// ************************************************************************* //
