fan/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           GAMG;
        tolerance        1e-7;
        relTol           0.01;
        // relTol 0; 

        smoother         DICGaussSeidel;

    }

    "(U|h|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }

    Phi
    {
        solver GAMG; 
        tolerance 1e-8; 
        relTol .01; 

        smoother DICGaussSeidel; 
    }
}

SIMPLE
{
    momentumPredictor yes;
    nNonOrthogonalCorrectors 0;
    // pRefCell        0;
    // pRefValue       0;

    consistent yes; 

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

relaxationFactors
{
    fields
    {
        rho                1;
        p_rgh              .7;
    }
    equations
    {
        U               0.5;
        h               0.5;
        "(k|epsilon|omega)" 0.7;
    }
}

potentialFlow
{
    nNonOrthogonalCorrectors 100; 
}

// ************************************************************************* //
