fan/system/singleGraph
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     |
    \\  /    A nd           | Web:      www.OpenFOAM.org
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes graph data for specified fields along a line, specified by start
    and end points.

\*---------------------------------------------------------------------------*/

H 20; 
R 2; 

start   (0 $R 0);
end     (0 $R $H);
fields  (T rho U);

interpolationScheme cellPoint;

setFormat   raw;

setConfig
{
    // type    uniform;   // midPoint, midPointAndFace
    type midPoint; 
    axis    z;  // x, y, z, xyz
    // nPoints 100;
}

// Must be last entry
#includeEtc "caseDicts/postProcessing/graphs/graph.cfg"

// ************************************************************************* //
